; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v1)
		(pred_5 ?v2)
		(pred_6 ?v8)
		(pred_1 ?v8)
		(pred_2 ?v2 ?v8)
		(pred_3)
		(pred_4 ?v2))

   (:action op_3
       :parameters  (?v4 ?v5)
       :precondition (and (not-eq ?v4 ?v5) 
                          (pred_6 ?v4) (pred_6 ?v5) (pred_1 ?v4))
       :effect (and  (pred_1 ?v5)
		     (not (pred_1 ?v4))))


   (:action op_1
       :parameters (?v3 ?v7)
       :precondition  (and  (pred_5 ?v3) (pred_6 ?v7)
			    (pred_2 ?v3 ?v7) (pred_1 ?v7) (pred_3))
       :effect (and (pred_4 ?v3)
		    (not (pred_2 ?v3 ?v7)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v3  ?v7)
       :precondition  (and  (pred_5 ?v3) (pred_6 ?v7)
			    (pred_4 ?v3) (pred_1 ?v7))
       :effect (and (pred_2 ?v3 ?v7)
		    (pred_3)
		    (not (pred_4 ?v3)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_06 obj_07 obj_01 obj_03 
          obj_02 obj_05 obj_04 
)
(:init
(pred_6 obj_06)
(pred_6 obj_07)
(pred_6 obj_01)
(pred_6 obj_03)
(pred_5 obj_02)
(pred_5 obj_05)
(pred_5 obj_04)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(pred_3)
(pred_2 obj_02 obj_01)
(pred_2 obj_05 obj_07)
(pred_2 obj_04 obj_07)
(pred_1 obj_03)
)
(:goal
(and
(pred_2 obj_02 obj_03)
(pred_2 obj_05 obj_07)
(pred_2 obj_04 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_02 obj_03) (pred_1 obj_06))
    (sometime-before  (pred_2 obj_04 obj_06) (pred_1 obj_01))
  )
)
)

; plan
1. (op_3 obj_03 obj_07)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_07)
   goals met: 1 of 3
2. (op_1 obj_04 obj_07)
   deleted: (pred_2 obj_04 obj_07) (pred_3)
   added: (pred_4 obj_04)
   goals met: 1 of 3
3. (op_3 obj_07 obj_01)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_01)
   goals met: 1 of 3
4. (op_3 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 1 of 3
5. (op_2 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_2 obj_04 obj_06) (pred_3)
   goals met: 2 of 3
6. (op_3 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 2 of 3
7. (op_1 obj_02 obj_01)
   deleted: (pred_2 obj_02 obj_01) (pred_3)
   added: (pred_4 obj_02)
   goals met: 2 of 3
8. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 2 of 3
9. (op_2 obj_02 obj_03)
   deleted: (pred_4 obj_02)
   added: (pred_2 obj_02 obj_03) (pred_3)
   goals met: 3 of 3
